app/controllers/episodes_controller.rb

SELECT "episodes".* FROM "episodes" WHERE "episodes"."tv_show_id" = ?  [["tv_show_id", 1]]
SELECT "episodes".* FROM "episodes"
---
  def index
    if params[:tv_show_id]
      render json: Episode.where(tv_show_id: params[:tv_show_id])
    else
      render json: Episode.all

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    render json: Episode.find(params[:id])

INSERT INTO "episodes" ("tv_show_id", "title", "episode", "watched", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tv_show_id", 1], ["title", "DOOM 444"], ["episode", 1], ["watched", "f"], ["created_at", "2015-06-22 15:26:31.531350"], ["updated_at", "2015-06-22 15:26:31.531350"]]
---
  def create
    episode = Episode.new(episode_params)
    if episode.save

DELETE FROM "episodes" WHERE "episodes"."id" = ?  [["id", 1]]
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    render json: Episode.find(params[:id]).delete