app/controllers/tv_shows_controller.rb

  def index
    render json: TvShow.all
---
SELECT "tv_shows".* FROM "tv_shows"

  def show
    render json: TvShow.find(params[:id])
---
SELECT  "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = ? LIMIT 1  [["id", 1]]

  def create
    tv_show = TvShow.new(tv_show_params)
    tv_show.user_id = current_user.id
    if tv_show.save
---
INSERT INTO "tv_shows" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "DOOM"], ["description", "Kill'em all"], ["user_id", 10], ["created_at", "2015-06-20 13:13:39.158483"], ["updated_at", "2015-06-20 13:13:39.158483"]]

  def update
    tv_show = TvShow.find(params[:id])
    if tv_show.update_attributes(tv_show_params)
---
SELECT  "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "tv_shows" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "tv_shows"."id" = ?  [["title", "DOOM 4"], ["description", "Cool"], ["updated_at", "2015-06-21 17:42:38.632545"], ["id", 1]]